vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
#include "app.h"
#include "gpio.h"
#include "main.h"
#include "tim.h"
#include <limits.h>
#include <stdio.h>
#include <string.h>
#include "stm32l4xx.h"  /* ITM/DBGMCU presence for optional binary SWO */

#include "Services/Log/log_service.h"
#include "Services/Motion/motion_service.h"
#include "Services/Motion/motion_hw.h"
#include "Services/Safety/safety_service.h"

#include "Protocol/Requests/move_queue_add_request.h"
#include "Protocol/Responses/move_queue_add_ack_response.h"
#include "Protocol/Requests/move_queue_status_request.h"
#include "Protocol/Responses/move_queue_status_response.h"
#include "Protocol/Requests/start_move_request.h"
#include "Protocol/Responses/start_move_response.h"
#include "Protocol/Requests/move_end_request.h"
#include "Protocol/Responses/move_end_response.h"
// Novos: set_origin e encoder_status
#include "Protocol/Requests/set_origin_request.h"
#include "Protocol/Responses/set_origin_response.h"
#include "Protocol/Requests/encoder_status_request.h"
#include "Protocol/Responses/encoder_status_response.h"
#include "Protocol/Requests/set_microsteps_request.h"
#include "Protocol/Requests/set_microsteps_axes_request.h"

LOG_SVC_DEFINE(LOG_SVC_MOTION, "motion");


#define MOTION_AXIS_COUNT        3u
// Aumenta a capacidade da fila de movimentos para reduzir "queue_full"
// Cada entrada consome ~42 bytes (move_queue_add_req_t); 256 => ~10.8 KB
#define MOTION_QUEUE_CAPACITY    256u

/* =======================
 *  Timings p/ TMC5160 + DDA
 *  (ajuste MOTION_TIM6_HZ se mudar TIM6)
 * ======================= */
#define MOTION_TIM6_HZ                 50000u   /* 50 kHz -> 20 us por tick */
#define MOTION_STEP_HIGH_TICKS         1u       /* largura do STEP: >= 1 tick (>=20us) */
#define MOTION_DIR_SETUP_TICKS         1u       
#define MOTION_ENABLE_SETTLE_TICKS     2u       

#define MOTION_STEP_LOW_TICKS          1u

#define Q16_1                          (1u<<16)
#define Q16_FROM_UINT(x)               ((uint32_t)(x) << 16)
#define Q16_DIV_UINT(numer,den)        ((uint32_t)(((uint64_t)(numer) << 16) / (uint32_t)(den)))
#ifndef MOTION_DEBUG_ENCODERS
#define MOTION_DEBUG_ENCODERS          1
#endif
#ifndef MOTION_DEBUG_FLOW
#define MOTION_DEBUG_FLOW              0
#endif
#ifndef MOTION_DEBUG_TIM6_PRINTS
#define MOTION_DEBUG_TIM6_PRINTS       0
#endif
#ifndef MOTION_DEBUG_STEP_DECIM
#define MOTION_DEBUG_STEP_DECIM        500u
#endif

// Emissão de CSV/telemetria
#ifndef MOTION_CSV_AT_STEP
#define MOTION_CSV_AT_STEP             1u
#endif
#ifndef MOTION_CSV_STEP_DECIM
#define MOTION_CSV_STEP_DECIM          100u   /* imprime a cada N passos após o primeiro */
#endif

// Amostragem periódica do CSV (em ms). Ajuste conforme necessário.
#ifndef MOTION_CSV_SAMPLE_MS
#define MOTION_CSV_SAMPLE_MS            1u
#endif

// Produção rígida a cada 1 ms no TIM6 (50 kHz) com ring buffer (SPSC)
#ifndef MOTION_CSV_PRODUCE_IN_TIM6
#define MOTION_CSV_PRODUCE_IN_TIM6      0u   /* amostra e imprime no TIM7, sempre após atualizar encoders */
#endif
#ifndef MOTION_CSV_TEXT_ENABLE
#define MOTION_CSV_TEXT_ENABLE           0u   /* 0=desliga printf textual; 1=liga printf textual */
#endif
#ifndef MOTION_CSV_RING_CAP
#define MOTION_CSV_RING_CAP             512u /* 16 bytes × 512 × 3 eixos ≈ 24 KB */
#endif
#ifndef MOTION_CSV_DRAIN_PER_TICK
#define MOTION_CSV_DRAIN_PER_TICK       128u /* aumenta drenagem para aliviar backlog rapidamente */
#endif

/* Debug opcional: loga resumo do alinhamento do eixo Y no final do movimento */
#ifndef MOTION_DEBUG_Y_CMD_LOG
#define MOTION_DEBUG_Y_CMD_LOG 1
#endif
#if MOTION_DEBUG_Y_CMD_LOG
static inline void cascade_dbg_arm(void);
static inline void cascade_dbg_report(const char *reason);
#endif

/* =======================
 *  Amostrador de velocidade (resumo ao final)
 * ======================= */
#ifndef MOTION_VEL_SAMPLER_ENABLE
#define MOTION_VEL_SAMPLER_ENABLE 1u
#endif
#ifndef MOTION_VEL_SAMPLER_SAMPLES
#define MOTION_VEL_SAMPLER_SAMPLES 250u
#endif
/* Janela de média móvel para suavizar a velocidade do encoder (em amostras de 1 ms) */
#ifndef MOTION_VEL_SMOOTH_WIN
#define MOTION_VEL_SMOOTH_WIN 10u
#endif

/* =======================
 *  Compatibilidade "progress" (interactive_old_sim)
 *  - Seleciona mestre por menor progresso (emitted/total)
 *  - Rampa guiada pelo restante do mestre (fila inclusa)
 *  - Conclusão global quando restante do mestre chega a zero
 * ======================= */
#ifndef MOTION_PROGRESS_MODE
#define MOTION_PROGRESS_MODE 1
#endif

/* =======================
 *  Throttle por erro (modo progress)
 *  - Reduz feed dos eixos não-mestres conforme |erro| cresce
 *  - Fórmula (per-mille):
 *      scale = 1 - (1 - min_frac) * min(|err|/threshold, 1)
 *      v_cmd <- v_cmd * scale
 *  - Parâmetros alinhados ao interactive_old_sim (threshold=200, min_frac=0.25)
 * ======================= */
#ifndef MOTION_ERR_THROTTLE_ENABLE
#define MOTION_ERR_THROTTLE_ENABLE 1
#endif
#ifndef MOTION_ERR_THROTTLE_THRESHOLD
#define MOTION_ERR_THROTTLE_THRESHOLD 50u  /* steps (mais sensível) */
#endif
#ifndef MOTION_ERR_THROTTLE_MIN_PERMILLE
#define MOTION_ERR_THROTTLE_MIN_PERMILLE 500u /* piso 50% do v_cmd (redução mais forte) */
#endif

/* Quando habilitado, o throttle do progresso usa erro RELATIVO AO MESTRE
 * (progresso do mestre -> passos esperados no eixo não-mestre) em vez de
 * comparar o eixo apenas contra seu próprio target. Isso replica a
 * semântica do interactive_old_sim (alinhamento cascata). */
#ifndef MOTION_CASCADE_MASTER_RELATIVE_ENABLE
#define MOTION_CASCADE_MASTER_RELATIVE_ENABLE 1
#endif

/* =======================
 *  Modelo de atrito (C + B·v)
 *  - MOTION_FRICTION_ENABLE: liga/desliga o modelo
 *  - C: offset "estático" (steps/s)
 *  - B: atrito viscoso em permille (0..1000) sobre v_cmd
 * ======================= */
#ifndef MOTION_FRICTION_ENABLE
#define MOTION_FRICTION_ENABLE 1u
#endif

/* Valores para o eixo X (ajuste depois conforme os testes) */
#ifndef MOTION_FRICTION_C_X_SPS
#define MOTION_FRICTION_C_X_SPS    20u    /* offset estático bem baixo (steps/s) */
#endif
#ifndef MOTION_FRICTION_B_X_PM
#define MOTION_FRICTION_B_X_PM     20u    /* ~2% de atrito viscoso */
#endif

/* =======================
 *  Teste: botão B2 alterna escala
 *  - Alterna 100% <-> reduzido (permille) para o eixo X
 *  - Debounce simples + janela opcional de hold
 * ======================= */
#ifndef MOTION_TEST_B2_DEBOUNCE_MS
#define MOTION_TEST_B2_DEBOUNCE_MS 200u
#endif
#ifndef MOTION_TEST_B2_HOLD_MS
#define MOTION_TEST_B2_HOLD_MS 0u /* 0 => sem exigência de hold */
#endif

// Opções de formato/rápidez (padrões conservadores p/ compatibilidade)
#ifndef MOTION_CSV_INCLUDE_ID
#define MOTION_CSV_INCLUDE_ID           0u   /* adiciona um id incremental por eixo */
#endif
#ifndef MOTION_CSV_TIME_IN_TICKS
#define MOTION_CSV_TIME_IN_TICKS        0u   /* 0=imprime tempo em ms (compat), 1=ticks TIM6 (mais barato) */
#endif
#ifndef MOTION_CSV_BIN_ITM
#define MOTION_CSV_BIN_ITM              0u   /* 1=encaminha frame binário via ITM (menos CPU/bytes) */
#endif

// Conversão de tempo baseada no clock do TIM6
// Ex.: 50 kHz => 50 ticks por milissegundo
#define T6_TICKS_PER_MS                 (MOTION_TIM6_HZ / 1000u)

// Contador monotônico de ticks do TIM6 (incrementa a cada update)
static volatile uint32_t g_tim6_ticks = 0u;

#define DEMO_ACCEL_SPS2                200000u  /* ~50 ms p/ ir a 10k sps */

/* Limite físico de passos/s com largura mínima de STEP e tLOW implícito */
#define MOTION_MIN_LOW_TICKS   ( (MOTION_STEP_LOW_TICKS) ? (MOTION_STEP_LOW_TICKS) : 1u )
#define MOTION_MAX_SPS         ( (MOTION_TIM6_HZ) / ( (MOTION_STEP_HIGH_TICKS) + (MOTION_MIN_LOW_TICKS) ) )

/* =======================
 *  Tipos/estados
 * ======================= */
typedef struct {
    uint32_t total_steps;
    uint32_t target_steps;        /* caminho fila/protocolo preservado */
    uint32_t emitted_steps;

    uint16_t velocity_per_tick;   /* ~ steps/ms (se TIM7 ~1kHz). 10 => ~10k steps/s */

    /* Ganhos PID (mantidos) */
    uint16_t kp, ki, kd;

