vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    uint32_t C    = g_axis_friction_C_sps[axis];
    uint16_t B_pm = g_axis_friction_B_pm[axis];

    /* Limita o offset estático a no máximo v_cmd/4 para não travar baixa velocidade */
    uint32_t quarter = (v >> 2); /* v/4 */
    uint32_t C_eff = C;
    if (C_eff > quarter) C_eff = quarter;

    /* Região de atrito estático: se v <= C_eff, motor não "anda" */
    if (v <= C_eff) {
        return 0u;
    }

    /* Tira o offset estático efetivo */
    uint32_t v_after_c = v - C_eff;

    /* Atrito viscoso proporcional à velocidade restante: B% */
    uint32_t visc = (uint32_t)(((uint64_t)v_after_c * (uint64_t)B_pm) / 1000u);

    if (visc >= v_after_c) {
        return 0u;
    }

    v = v_after_c - visc;

    if (v > MOTION_MAX_SPS) v = MOTION_MAX_SPS;
    return v;
}
#endif

/* ---- Amostrador de velocidade (após defs. de eixos/encoders) ---- */
#if MOTION_VEL_SAMPLER_ENABLE
static volatile uint8_t  g_vel_armed = 0u;
static volatile uint16_t g_vel_count = 0u;
static uint32_t          g_vel_t0_ms = 0u;   /* legado (não usado para o tempo) */
static uint32_t          g_vel_t0_t6 = 0u;   /* tick base do TIM6 (50 kHz) */
static uint32_t          g_vel_time_ms[MOTION_VEL_SAMPLER_SAMPLES];
/* Velocidades medidas VIA ENCODER em passos/seg (signed) */
static int32_t           g_vel_vx[MOTION_VEL_SAMPLER_SAMPLES];
static int32_t           g_vel_vy[MOTION_VEL_SAMPLER_SAMPLES];
static int32_t           g_vel_vz[MOTION_VEL_SAMPLER_SAMPLES];
/* Velocidades comandadas (pós-throttle/PI; ou v_target no modo demo) */
static uint32_t          g_vel_cmd_vx[MOTION_VEL_SAMPLER_SAMPLES];
static uint32_t          g_vel_cmd_vy[MOTION_VEL_SAMPLER_SAMPLES];
static uint32_t          g_vel_cmd_vz[MOTION_VEL_SAMPLER_SAMPLES];
/* Snapshot atual do comando (atualizado no TIM7 durante o cálculo) */
static volatile uint32_t g_vel_cmd_sps[3] = {0u,0u,0u};
/* Históricos/somas para média móvel */
static int32_t           g_vel_hist_x[MOTION_VEL_SMOOTH_WIN];
static int32_t           g_vel_hist_y[MOTION_VEL_SMOOTH_WIN];
static int32_t           g_vel_hist_z[MOTION_VEL_SMOOTH_WIN];
static int64_t           g_vel_sum_x = 0, g_vel_sum_y = 0, g_vel_sum_z = 0;
static uint8_t           g_vel_hist_idx = 0u;      /* cursor 0..WIN-1 */
static uint8_t           g_vel_hist_count = 0u;    /* quantas amostras válidas na janela */

typedef struct {
    uint8_t  armed;
    uint8_t  clamp_y;
    uint8_t  clamp_z;
    uint32_t baseline_y;
    uint32_t baseline_z;
    uint32_t min_y;
    uint32_t min_z;
} cascade_dbg_t;

static cascade_dbg_t g_cascade_dbg = {0};

static inline void vel_sampler_reset(void)
{
    g_vel_armed = 0u;
    g_vel_count = 0u;
    g_vel_sum_x = g_vel_sum_y = g_vel_sum_z = 0;
    g_vel_hist_idx = 0u;
    g_vel_hist_count = 0u;
    for (uint8_t i = 0; i < (uint8_t)MOTION_VEL_SMOOTH_WIN; ++i) {
        g_vel_hist_x[i] = 0;
        g_vel_hist_y[i] = 0;
        g_vel_hist_z[i] = 0;
    }
}

static inline void cascade_dbg_arm(void)
{
    g_cascade_dbg.armed     = 1u;
    g_cascade_dbg.clamp_y   = 0u;
    g_cascade_dbg.clamp_z   = 0u;
    g_cascade_dbg.baseline_y = g_vel_cmd_sps[AXIS_Y];
    g_cascade_dbg.baseline_z = g_vel_cmd_sps[AXIS_Z];
    g_cascade_dbg.min_y      = UINT32_MAX;
    g_cascade_dbg.min_z      = UINT32_MAX;
}

static inline void cascade_dbg_report(const char *reason)
{
    if (!g_cascade_dbg.armed) return;
    uint32_t min_y = (g_cascade_dbg.min_y == UINT32_MAX) ? g_vel_cmd_sps[AXIS_Y] : g_cascade_dbg.min_y;
    uint32_t min_z = (g_cascade_dbg.min_z == UINT32_MAX) ? g_vel_cmd_sps[AXIS_Z] : g_cascade_dbg.min_z;
    int32_t delta_y = (int32_t)g_cascade_dbg.baseline_y - (int32_t)min_y;
    int32_t delta_z = (int32_t)g_cascade_dbg.baseline_z - (int32_t)min_z;
    LOGA_THIS(LOG_STATE_APPLIED, 0,
              "cascade_summary",
              "reason=%s baseY=%lu minY=%lu deltaY=%ld clampY=%u | baseZ=%lu minZ=%lu deltaZ=%ld clampZ=%u",
              reason ? reason : "n/a",
              (unsigned long)g_cascade_dbg.baseline_y,
              (unsigned long)min_y,
              (long)delta_y,
              (unsigned)g_cascade_dbg.clamp_y,
              (unsigned long)g_cascade_dbg.baseline_z,
              (unsigned long)min_z,
              (long)delta_z,
              (unsigned)g_cascade_dbg.clamp_z);
    g_cascade_dbg.armed = 0u;
}

static inline void vel_sampler_arm(void)
{
    g_vel_t0_ms = HAL_GetTick(); /* mantido apenas para compat */
    g_vel_t0_t6 = g_tim6_ticks;
    g_vel_count = 0u;
    g_vel_armed = 1u;
}

static inline void vel_sampler_try_sample(void)
{
    if (!g_vel_armed) return;
    if (g_vel_count >= (uint16_t)MOTION_VEL_SAMPLER_SAMPLES) return;
    uint16_t idx = g_vel_count;
    /* Tempo relativo baseado no TIM6 (50 kHz) convertido para ms */
    uint32_t dt_t6 = g_tim6_ticks - g_vel_t0_t6;
    g_vel_time_ms[idx] = dt_t6 / (uint32_t)T6_TICKS_PER_MS;
    /* Converter delta de encoder (contagens por 1ms) em passos/seg (DDA) */
    /* sps = (delta_counts * DDA_STEPS_PER_REV(axis) * 1000) / ENC_COUNTS_PER_REV[axis] */
    int32_t sps_x = 0, sps_y = 0, sps_z = 0;
    {
        int32_t d = g_encoder_delta_tick[AXIS_X];
        int64_t num = (int64_t)d * (int64_t)dda_steps_per_rev_axis(AXIS_X) * 1000LL;
        if (ENC_COUNTS_PER_REV[AXIS_X] > 0u) sps_x = (int32_t)(num / (int64_t)ENC_COUNTS_PER_REV[AXIS_X]);
    }
    {
        int32_t d = g_encoder_delta_tick[AXIS_Y];
        int64_t num = (int64_t)d * (int64_t)dda_steps_per_rev_axis(AXIS_Y) * 1000LL;
        if (ENC_COUNTS_PER_REV[AXIS_Y] > 0u) sps_y = (int32_t)(num / (int64_t)ENC_COUNTS_PER_REV[AXIS_Y]);
    }
    {
        int32_t d = g_encoder_delta_tick[AXIS_Z];
        int64_t num = (int64_t)d * (int64_t)dda_steps_per_rev_axis(AXIS_Z) * 1000LL;
        if (ENC_COUNTS_PER_REV[AXIS_Z] > 0u) sps_z = (int32_t)(num / (int64_t)ENC_COUNTS_PER_REV[AXIS_Z]);
    }

    /* Atualiza janela deslizante (média móvel) */
    if (g_vel_hist_count < (uint8_t)MOTION_VEL_SMOOTH_WIN) {
        g_vel_hist_count++;
    } else {
        /* Remove amostras antigas da soma */
        g_vel_sum_x -= (int64_t)g_vel_hist_x[g_vel_hist_idx];
        g_vel_sum_y -= (int64_t)g_vel_hist_y[g_vel_hist_idx];
        g_vel_sum_z -= (int64_t)g_vel_hist_z[g_vel_hist_idx];
    }
    /* Adiciona amostras novas */
    g_vel_hist_x[g_vel_hist_idx] = sps_x;
    g_vel_hist_y[g_vel_hist_idx] = sps_y;
    g_vel_hist_z[g_vel_hist_idx] = sps_z;
    g_vel_sum_x += (int64_t)sps_x;
    g_vel_sum_y += (int64_t)sps_y;
    g_vel_sum_z += (int64_t)sps_z;
    g_vel_hist_idx = (uint8_t)((g_vel_hist_idx + 1u) % (uint8_t)MOTION_VEL_SMOOTH_WIN);

