vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    int32_t avg_x = (int32_t)(g_vel_sum_x / (int64_t)g_vel_hist_count);
    int32_t avg_y = (int32_t)(g_vel_sum_y / (int64_t)g_vel_hist_count);
    int32_t avg_z = (int32_t)(g_vel_sum_z / (int64_t)g_vel_hist_count);

    g_vel_vx[idx] = avg_x;
    g_vel_vy[idx] = avg_y;
    g_vel_vz[idx] = avg_z;
    /* Captura também os comandos atuais */
    g_vel_cmd_vx[idx] = g_vel_cmd_sps[AXIS_X];
    g_vel_cmd_vy[idx] = g_vel_cmd_sps[AXIS_Y];
    g_vel_cmd_vz[idx] = g_vel_cmd_sps[AXIS_Z];
    g_vel_count = (uint16_t)(idx + 1u);
}

static inline void vel_sampler_dump_and_reset(void)
{
    if (!g_vel_count) { vel_sampler_reset(); return; }
    /* Cabeçalho simples */
    uint32_t duration_ms = (g_tim6_ticks - g_vel_t0_t6) / (uint32_t)T6_TICKS_PER_MS;
    printf("VEL_SAMPLES count=%u\r\n", (unsigned)g_vel_count);
    printf("id,time_ms,vx_enc_sps,vy_enc_sps,vz_enc_sps,vx_cmd_sps,vy_cmd_sps,vz_cmd_sps\r\n");
    for (uint16_t i = 0; i < g_vel_count; ++i) {
        printf("%u,%lu,%ld,%ld,%ld,%lu,%lu,%lu\r\n",
               (unsigned)i,
               (unsigned long)g_vel_time_ms[i],
               (long)g_vel_vx[i],
               (long)g_vel_vy[i],
               (long)g_vel_vz[i],
               (unsigned long)g_vel_cmd_vx[i],
               (unsigned long)g_vel_cmd_vy[i],
               (unsigned long)g_vel_cmd_vz[i]);
    }
    /* Resumo: duração total da sessão em milissegundos */
    printf("VEL_END,%lu\r\n", (unsigned long)duration_ms);
    vel_sampler_reset();
}
#else
static inline void vel_sampler_reset(void) {}
static inline void vel_sampler_arm(void) {}
static inline void vel_sampler_try_sample(void) {}
static inline void vel_sampler_dump_and_reset(void) {}
#endif /* MOTION_VEL_SAMPLER_ENABLE */

/* Soma restante (em passos) no eixo, incluindo segmento ativo + fila
 * Usado para decidir desaceleração suave no final da lista de movimentos. */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis)
{
    uint32_t rem = 0u;
    if (axis < MOTION_AXIS_COUNT) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        if (ax->total_steps > ax->emitted_steps)
            rem += (ax->total_steps - ax->emitted_steps);
    }
    for (uint16_t i = 0; i < g_queue_count; ++i) {
        uint8_t idxq = (uint8_t)(((uint16_t)g_queue_head + i) % MOTION_QUEUE_CAPACITY);
        const move_queue_add_req_t *q = &g_queue[idxq].req;
        rem += motion_total_for_axis(q, axis);
    }
    return rem;
}

/* =======================
 *  Status e fila
 * ======================= */
static void motion_refresh_status_locked(void) {
    /* depth reportado cabe em 8 bits; faz clamp para 255 */
    uint32_t depth32 = (uint32_t)g_queue_count + (uint32_t)(g_has_active_segment ? 1u : 0u);
    if (depth32 > 255u) depth32 = 255u;
    g_status.queue_depth = (uint8_t)depth32;

    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t total = ax->total_steps;
        uint32_t emitted = ax->emitted_steps;
        uint8_t pct = 0u;

        if (g_has_active_segment && total > 0u) {
            uint64_t scaled = (uint64_t)emitted * 100u;
            pct = (uint8_t)(scaled / total);
            if (pct > 100u) pct = 100u;
        } else if (total == 0u && g_has_active_segment) {
            pct = 100u;
        } else if (!g_has_active_segment && total > 0u) {
            pct = (emitted >= total) ? 100u : (uint8_t)(((uint64_t)emitted * 100u) / total);
        }

        /* Erro em UNIDADES DE PASSOS (alinhado ao PI de posição)
         * desired_steps = passos emitidos no segmento (target_steps)
         * actual_steps  = encoder_rel convertido para passos DDA
         */
        int64_t enc_rel = g_encoder_position[axis] - g_encoder_origin[axis];
        if (enc_rel > (int64_t)INT32_MAX) enc_rel = INT32_MAX;
        else if (enc_rel < (int64_t)INT32_MIN) enc_rel = INT32_MIN;
        int64_t num = enc_rel * (int64_t)dda_steps_per_rev_axis(axis);
        int32_t actual_steps = (ENC_COUNTS_PER_REV[axis]
                                ? (int32_t)(num / (int64_t)ENC_COUNTS_PER_REV[axis])
                                : 0);
        int32_t desired_steps = (int32_t)ax->target_steps;
        int32_t err = desired_steps - actual_steps;
        int8_t  err8 = motion_clamp_error(err);

        switch (axis) {
            case AXIS_X: g_status.pctX = pct; g_status.pidErrX = err8; break;
            case AXIS_Y: g_status.pctY = pct; g_status.pidErrY = err8; break;
            case AXIS_Z:
            default:     g_status.pctZ = pct; g_status.pidErrZ = err8; break;
        }
    }
}


static void motion_stop_all_axes_locked(void) {
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        motion_hw_step_low(axis);
        motion_hw_enable(axis, 0u);

        motion_axis_state_t *ax = &g_axis_state[axis];
        ax->total_steps       = 0u;
        ax->target_steps      = 0u;
        ax->emitted_steps     = 0u;

        ax->velocity_per_tick = 0u;
        ax->kp = 0u; ax->ki = 0u; ax->kd = 0u;

        /* limpa controle de pulso/guardas */
        ax->step_high         = 0u;
        ax->step_low          = 0u;
        ax->en_settle_ticks   = 0u;
        ax->dir_settle_ticks  = 0u;

        /* limpa DDA/rampa */
        ax->dda_accum_q16     = 0u;
        ax->dda_inc_q16       = 0u;
        ax->v_target_sps      = 0u;
        ax->v_actual_sps      = 0u;
        ax->accel_sps2        = 0u;
    }
}


static void motion_queue_clear_locked(void) {
    g_queue_head = 0u;
    g_queue_tail = 0u;
    g_queue_count = 0u;
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_queue_rem_steps[a] = 0u;
}

static proto_result_t motion_queue_push_locked(const move_queue_add_req_t *req) {
    if (g_queue_count >= MOTION_QUEUE_CAPACITY)
        return PROTO_ERR_RANGE;
    g_queue[g_queue_tail].req = *req;
    g_queue_tail = (uint8_t)((g_queue_tail + 1u) % MOTION_QUEUE_CAPACITY);
    ++g_queue_count;
    /* Atualiza soma de passos restantes na FILA (por eixo) */
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
        g_queue_rem_steps[a] += motion_total_for_axis(req, a);
    }
    motion_refresh_status_locked();
    return PROTO_OK;
}

