vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    memset(&g_status, 0, sizeof g_status);
    memset(g_axis_state, 0, sizeof g_axis_state);
    memset(g_queue, 0, sizeof g_queue);
    memset(g_encoder_position, 0, sizeof g_encoder_position);
    memset(g_encoder_last_raw, 0, sizeof g_encoder_last_raw);
    memset(g_encoder_origin, 0, sizeof g_encoder_origin);
    memset(g_encoder_delta_tick, 0, sizeof g_encoder_delta_tick);
    memset(g_pi_i_accum, 0, sizeof g_pi_i_accum);
    memset(g_pi_prev_err, 0, sizeof g_pi_prev_err);
    memset(g_origin_base32, 0, sizeof g_origin_base32);
    memset(g_pi_d_filt, 0, sizeof g_pi_d_filt);
    memset(g_v_accum, 0, sizeof g_v_accum);
    for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_queue_rem_steps[a] = 0u;
    memset((void*)g_csv_active, 0, sizeof g_csv_active);
    memset((void*)g_csv_t0_ms, 0, sizeof g_csv_t0_ms);
    memset((void*)g_csv_stepcount, 0, sizeof g_csv_stepcount);
    memset((void*)g_csv_next_ms, 0, sizeof g_csv_next_ms);
    memset((void*)g_csv_armed, 0, sizeof g_csv_armed);
    memset((void*)g_csv_t0_t6, 0, sizeof g_csv_t0_t6);
    memset((void*)g_csv_next_t6, 0, sizeof g_csv_next_t6);
    memset((void*)g_csv_seq, 0, sizeof g_csv_seq);
    g_tim6_ticks = 0u;
#if MOTION_CSV_PRODUCE_IN_TIM6
    csv_ring_reset();
#endif

    g_status.state = MOTION_IDLE;
    g_queue_head = g_queue_tail = g_queue_count = 0u;
    g_has_active_segment = 0u;

#if MOTION_FRICTION_ENABLE
    /* Inicializa parâmetros de atrito (por enquanto só X configurado por macro) */
    g_axis_friction_C_sps[AXIS_X] = MOTION_FRICTION_C_X_SPS;
    g_axis_friction_B_pm[AXIS_X]  = MOTION_FRICTION_B_X_PM;
    /* Inicia com atrito DESLIGADO; o botão B2 alterna quando desejado */
    g_axis_friction_enabled[AXIS_X] = 0u;
    /* Se quiser atrito em Y/Z:
     * g_axis_friction_C_sps[AXIS_Y] = ...;
     * g_axis_friction_B_pm[AXIS_Y]  = ...;
     */
#endif

    motion_stop_all_axes_locked();
    motion_refresh_status_locked();
    motion_unlock(primask);

#if MOTION_VEL_SAMPLER_ENABLE
    vel_sampler_reset();
#endif
#if MOTION_DEBUG_Y_CMD_LOG
    g_cascade_dbg.armed = 0u;
    g_cascade_dbg.clamp_y = 0u;
    g_cascade_dbg.clamp_z = 0u;
    g_cascade_dbg.baseline_y = g_cascade_dbg.baseline_z = 0u;
    g_cascade_dbg.min_y = g_cascade_dbg.min_z = 0u;
#endif

    motion_hw_init();

    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        uint32_t raw = motion_hw_encoder_read_raw(axis);
        if (motion_hw_encoder_bits(axis) == 16u) {
            g_encoder_last_raw[axis] = raw & 0xFFFFu;
        } else {
            g_encoder_last_raw[axis] = raw;
        }
    }

    if (HAL_TIM_Base_Start_IT(&htim6) != HAL_OK) Error_Handler();
    if (HAL_TIM_Base_Start_IT(&htim7) != HAL_OK) Error_Handler();

    LOGT_THIS(LOG_STATE_START, PROTO_OK, "init", "timers_ready");
}

const motion_status_t* motion_status_get(void) {
    return &g_status;
}

/* =======================
 *  Tick do TIM6 (50 kHz)
 *  - fecha largura de pulso
 *  - DEMO: DDA suave
 *  - Fila: caminho original
 * ======================= */
void motion_on_tim6_tick(void)
{
    // Incrementa base de tempo de 50 kHz para telemetria
    g_tim6_ticks++;
    if (g_status.state != MOTION_RUNNING || !g_has_active_segment)
        return;

    /* 1) Fecha pulsos altos pendentes (garante largura do STEP) */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        motion_axis_state_t *ax = &g_axis_state[axis];
        if (ax->step_high) {
            if (--ax->step_high == 0u) {
                motion_hw_step_low(axis);
                ax->step_low = MOTION_STEP_LOW_TICKS; /* Para voltar ao comportamento anterior, defina MOTION_STEP_LOW_TICKS=0u */
            }
        } else if (ax->step_low) {
            --ax->step_low;
        }
    }

    if (g_demo_continuous) {
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];

            if (ax->emitted_steps >= ax->total_steps) continue;

            /* guardas de ENABLE e DIR (atendem setup/hold do TMC5160) */
            if (ax->en_settle_ticks)  { ax->en_settle_ticks--;  continue; }
            if (ax->dir_settle_ticks) { ax->dir_settle_ticks--; continue; }

            if (ax->step_high) continue; /* ainda segurando pulso ALTO */
            if (ax->step_low)  continue; 

            /* DDA: acumula fase e emite STEP ao cruzar 1.0 */
            ax->dda_accum_q16 += ax->dda_inc_q16;
            if (ax->dda_accum_q16 >= Q16_1) {
                ax->dda_accum_q16 -= Q16_1;

                motion_hw_step_high(axis);
                ax->step_high = MOTION_STEP_HIGH_TICKS;
                ++ax->emitted_steps;
                g_csv_stepcount[axis]++;
                if (!g_csv_active[axis]) {
                    g_csv_active[axis] = 1u;
                    g_csv_armed[axis]  = 0u;
                    uint32_t now_t6 = g_tim6_ticks;
                    g_csv_t0_t6[axis] = now_t6;
                    g_csv_next_t6[axis] = now_t6;
                }
#if MOTION_CSV_AT_STEP && !MOTION_CSV_PRODUCE_IN_TIM6
                if (g_csv_active[axis]) {
                    uint32_t dt_t6 = g_tim6_ticks - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
                    uint32_t t_val = dt_t6;
#else
                    uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
                    int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
                    if (g_csv_stepcount[axis] == 1u || (g_csv_stepcount[axis] % MOTION_CSV_STEP_DECIM) == 0u) {
                        uint32_t pm = motion_lock();
                        uint32_t id = ++g_csv_seq[axis];
                        motion_unlock(pm);
                        motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
                    }
                }
#endif
#if MOTION_DEBUG_FLOW
                #if MOTION_DEBUG_TIM6_PRINTS
                if ((++g_step_print_count[axis] % MOTION_DEBUG_STEP_DECIM) == 1u) {
                    printf("[STEP axis=%u emitted=%lu target=%lu total=%lu]\r\n",
                           (unsigned)axis,
                           (unsigned long)ax->emitted_steps,
                           (unsigned long)ax->target_steps,
                           (unsigned long)ax->total_steps);
                }
                #endif
#endif
            }
        }
    }
    else {
        /* 3) Caminho original (fila): preservado */
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];

