vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    // Atualiza sombras 32-bit para SWV/Data Trace (4 bytes por amostra)
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        g_enc_abs32[axis] = (int32_t)g_encoder_position[axis];
        g_enc_rel32[axis] = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
    }

    /* DEMO: aplica rampa e calcula incremento do DDA */
    if (g_status.state == MOTION_RUNNING && g_has_active_segment && g_demo_continuous) {
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];
            if (ax->emitted_steps >= ax->total_steps) continue;

            /* Aceleração integrada: acumula a/1000 e aplica passos discretos em v */
            g_v_accum[axis] += ax->accel_sps2; /* steps/s^2 * 1ms */
            uint32_t steps_avail = 0u;
            while (g_v_accum[axis] >= 1000u) { g_v_accum[axis] -= 1000u; steps_avail++; }
            while (steps_avail--) {
                if (ax->v_actual_sps < ax->v_target_sps) {
                    ax->v_actual_sps++;
                    if (ax->v_actual_sps > ax->v_target_sps) ax->v_actual_sps = ax->v_target_sps;
                } else if (ax->v_actual_sps > ax->v_target_sps) {
                    if (ax->v_actual_sps > 0u) ax->v_actual_sps--;
                    if (ax->v_actual_sps < ax->v_target_sps) ax->v_actual_sps = ax->v_target_sps;
                }
            }
            if (ax->v_actual_sps > MOTION_MAX_SPS) ax->v_actual_sps = MOTION_MAX_SPS;
            /* Comando (demo): alvo de velocidade */
            g_vel_cmd_sps[axis] = ax->v_target_sps;
#if MOTION_DEBUG_Y_CMD_LOG
            if (g_cascade_dbg.armed) {
                uint32_t cmd = g_vel_cmd_sps[axis];
                if (axis == AXIS_Y) {
                    if (cmd >= MOTION_MAX_SPS) g_cascade_dbg.clamp_y = 1u;
                    if (cmd < g_cascade_dbg.min_y) g_cascade_dbg.min_y = cmd;
                } else if (axis == AXIS_Z) {
                    if (cmd >= MOTION_MAX_SPS) g_cascade_dbg.clamp_z = 1u;
                    if (cmd < g_cascade_dbg.min_z) g_cascade_dbg.min_z = cmd;
                }
            }
#endif
#if MOTION_FRICTION_ENABLE
            /* DEMO: aplica atrito pós-rampa (C + B·v) na velocidade efetiva */
            ax->v_actual_sps = motion_apply_friction(axis, ax->v_actual_sps);
#endif
            ax->dda_inc_q16 = Q16_DIV_UINT(ax->v_actual_sps, MOTION_TIM6_HZ);
        }
    }
    /* Caminho da fila: rampa trapezoidal (acelera/cruza/desacelera) e define incremento DDA */
    if (g_status.state == MOTION_RUNNING && g_has_active_segment && !g_demo_continuous) {
#if MOTION_PROGRESS_MODE
        int8_t master_axis = motion_select_master_axis_progress();
        uint32_t rem_master = 0u;
        if (master_axis >= 0) {
            const motion_axis_state_t *am = &g_axis_state[(uint8_t)master_axis];
            uint32_t active_m = (am->total_steps > am->emitted_steps)
                                ? (am->total_steps - am->emitted_steps) : 0u;
            rem_master = active_m + g_queue_rem_steps[(uint8_t)master_axis];
        }
#endif
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            motion_axis_state_t *ax = &g_axis_state[axis];
            /* Mesmo que o segmento ativo para este eixo tenha zerado, podemos ter
               passos remanescentes na fila — mantemos a rampa global da lista. */

            uint32_t v_cmd_sps = ((uint32_t)ax->velocity_per_tick) * 1000u; /* alvo/cruzeiro */
#if MOTION_DEBUG_Y_CMD_LOG
            uint32_t v_cmd_before_thr = v_cmd_sps;
#endif

#if MOTION_PROGRESS_MODE && MOTION_ERR_THROTTLE_ENABLE
            /* Throttle por erro (apenas eixos não-mestres):
               - Opcionalmente usa erro relativo ao mestre (cascata) para alinhar
                 progresso entre eixos, espelhando a simulação antiga. */
            if (master_axis >= 0 && (int8_t)axis != master_axis) {
                int32_t desired;
#if MOTION_CASCADE_MASTER_RELATIVE_ENABLE
                /* desired_nm = frac_mestre * total_nm (somente segmento ativo) */
                const motion_axis_state_t *am = &g_axis_state[(uint8_t)master_axis];
                uint32_t tm = am->total_steps ? am->total_steps : 1u;
                uint32_t em = am->emitted_steps;
                /* clamp */ if (em > tm) em = tm;
                uint64_t prod = (uint64_t)em * (uint64_t)ax->total_steps;
                uint64_t exp_steps = prod / (uint64_t)tm; /* esperado no eixo */
                if (exp_steps > (uint64_t)INT32_MAX) exp_steps = INT32_MAX;
                desired = (int32_t)exp_steps;
#else
                desired = (int32_t)ax->target_steps;
#endif
                int64_t enc_rel = g_encoder_position[axis] - g_encoder_origin[axis];
                int64_t num = enc_rel * (int64_t)dda_steps_per_rev_axis(axis);
                int32_t actual = 0;
                if (ENC_COUNTS_PER_REV[axis] > 0u) {
                    int64_t q = num / (int64_t)ENC_COUNTS_PER_REV[axis];
                    if (q > INT32_MAX) q = INT32_MAX; else if (q < INT32_MIN) q = INT32_MIN;
                    actual = (int32_t)q;
                }
                int32_t err = desired - actual;
                uint32_t err_abs = (err < 0) ? (uint32_t)(-err) : (uint32_t)err;

                uint32_t scale_pm;
                if (err_abs >= (uint32_t)MOTION_ERR_THROTTLE_THRESHOLD) {
                    scale_pm = (uint32_t)MOTION_ERR_THROTTLE_MIN_PERMILLE; /* piso */
                } else {
                    uint32_t range = 1000u - (uint32_t)MOTION_ERR_THROTTLE_MIN_PERMILLE; /* 0..(100%-piso) */
                    uint32_t dec = (uint32_t)(((uint64_t)range * (uint64_t)err_abs) / (uint32_t)MOTION_ERR_THROTTLE_THRESHOLD);
                    scale_pm = 1000u - dec; /* 1000..min_permille */
                }
                v_cmd_sps = (uint32_t)(((uint64_t)v_cmd_sps * (uint64_t)scale_pm) / 1000u);
                if (v_cmd_sps > MOTION_MAX_SPS) v_cmd_sps = MOTION_MAX_SPS;
            }
#endif /* MOTION_PROGRESS_MODE && MOTION_ERR_THROTTLE_ENABLE */
            /* PI de posição: ajusta v_cmd_sps com base no erro posicional */
#if MOTION_PI_ENABLE
            if ((ax->kp | ax->ki | ax->kd) != 0u) {
                /* desired (em passos DDA) vs actual convertido de contagens do encoder para passos DDA */
                int32_t desired = (int32_t)ax->target_steps;
                int64_t enc_rel = g_encoder_position[axis] - g_encoder_origin[axis];
                /* actual_steps ≈ enc_rel * (DDA_STEPS_PER_REV(axis) / ENC_COUNTS_PER_REV) */
                int64_t num = enc_rel * (int64_t)dda_steps_per_rev_axis(axis);
                int32_t actual = 0;
                if (ENC_COUNTS_PER_REV[axis] > 0u) {
                    int64_t q = num / (int64_t)ENC_COUNTS_PER_REV[axis];
                    if (q > INT32_MAX) q = INT32_MAX; else if (q < INT32_MIN) q = INT32_MIN;
                    actual = (int32_t)q;
                }
                int32_t err = desired - actual;
                /* Deadband simples */
                if (err > -((int32_t)MOTION_PI_DEADBAND_STEPS) && err < (int32_t)MOTION_PI_DEADBAND_STEPS) {
                    err = 0;
                }
                /* Integral com anti-windup (em unidades de passos) */
                int32_t iacc = g_pi_i_accum[axis] + err;
                if (iacc > MOTION_PI_I_CLAMP) iacc = MOTION_PI_I_CLAMP;
                else if (iacc < -MOTION_PI_I_CLAMP) iacc = -MOTION_PI_I_CLAMP;
                int32_t draw = err - g_pi_prev_err[axis];
                g_pi_prev_err[axis] = err;
                /* Derivada filtrada: g_pi_d_filt += (draw - g_pi_d_filt) >> alpha */
                const int32_t alpha = 8; /* filtro leve (1..16) */
                g_pi_d_filt[axis] = g_pi_d_filt[axis] + ((draw - g_pi_d_filt[axis]) >> alpha);
                int32_t pterm = ((int32_t)ax->kp * err) >> MOTION_PI_SHIFT;      /* steps/s */
                int32_t iterm = ((int32_t)ax->ki * iacc) >> MOTION_PI_SHIFT;     /* steps/s */
                int32_t dterm = (ax->kd != 0u) ? (((int32_t)ax->kd * g_pi_d_filt[axis]) >> MOTION_PI_SHIFT) : 0; /* steps/s */
                int32_t corr = pterm + iterm + dterm; /* correção em steps/s */
                if (corr > (int32_t)MOTION_PI_CORR_MAX_SPS) corr = (int32_t)MOTION_PI_CORR_MAX_SPS;
                else if (corr < -(int32_t)MOTION_PI_CORR_MAX_SPS) corr = -(int32_t)MOTION_PI_CORR_MAX_SPS;
                int32_t v_adj = (int32_t)v_cmd_sps + corr;
                if (v_adj < 0) v_adj = 0;
                if (v_adj > (int32_t)MOTION_MAX_SPS) v_adj = (int32_t)MOTION_MAX_SPS; /* limite físico */
                v_cmd_sps = (uint32_t)v_adj;
                /* Anti-windup por saturação: só aceita a integral quando não saturou */
                if (!(v_adj == 0 || v_adj == (int32_t)MOTION_MAX_SPS)) {
                    g_pi_i_accum[axis] = iacc;
                }
            }
#endif
#if MOTION_DEBUG_Y_CMD_LOG
            uint32_t v_cmd_after_pi = v_cmd_sps;
#endif
            /* Snapshot do comando (após throttle/PI) */
            g_vel_cmd_sps[axis] = v_cmd_sps;
#if MOTION_DEBUG_Y_CMD_LOG
            if (g_cascade_dbg.armed) {
                if (axis == AXIS_Y) {
                    if (v_cmd_sps >= MOTION_MAX_SPS) g_cascade_dbg.clamp_y = 1u;
                    if (v_cmd_sps < g_cascade_dbg.min_y) g_cascade_dbg.min_y = v_cmd_sps;
                } else if (axis == AXIS_Z) {
                    if (v_cmd_sps >= MOTION_MAX_SPS) g_cascade_dbg.clamp_z = 1u;
                    if (v_cmd_sps < g_cascade_dbg.min_z) g_cascade_dbg.min_z = v_cmd_sps;
                }
            }
#endif
            /* Atrito será aplicado pós-rampa (na v_actual_sps) para modelar planta */
            uint32_t a_sps2    = (ax->accel_sps2 > 0u) ? ax->accel_sps2 : DEMO_ACCEL_SPS2;

            /* Distância restante total (ativo + fila) em passos (O(1)) */
            uint32_t active_rem = (ax->total_steps > ax->emitted_steps)
                                  ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_steps = active_rem + g_queue_rem_steps[axis];
#if MOTION_PROGRESS_MODE
            /* Só impõe o restante do mestre se ele tiver trabalho pendente */
            if (master_axis >= 0 && rem_master > 0u) {
                rem_steps = rem_master;
            }
            /* caso contrário, mantém o rem_steps do próprio eixo
               para não “matar” a rampa dos demais */
#endif

