vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    motion_send_start_response(req.frameId, started ? 0u : 1u, g_status.queue_depth);
    LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "start_move", started ? "running" : "ignored");
#if MOTION_DEBUG_FLOW
    printf("[FLOW start_move %s]\r\n", started ? "running" : "ignored");
#endif
}

void motion_on_move_end(const uint8_t *frame, uint32_t len) {
    move_end_req_t req;
    if (move_end_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "move_end", "decode_fail");
        return;
    }
    uint32_t primask = motion_lock();
    motion_stop_all_axes_locked();
    motion_queue_clear_locked();
    g_has_active_segment = 0u;
    g_status.state = MOTION_STOPPING;
    motion_refresh_status_locked();
    motion_unlock(primask);

    motion_send_move_end_response(req.frameId, 1u /* stopped by host */);

    primask = motion_lock();
    g_status.state = MOTION_IDLE;
#if MOTION_VEL_SAMPLER_ENABLE
    vel_sampler_dump_and_reset();
#endif
#if MOTION_DEBUG_Y_CMD_LOG
    cascade_dbg_report("move_end");
#endif
    motion_refresh_status_locked();
    motion_unlock(primask);

    LOGT_THIS(LOG_STATE_APPLIED, PROTO_OK, "move_end", "stopped");
}

/* =======================
 *  set_origin e encoder_status (telemetria)
 * ======================= */
void motion_on_set_origin(const uint8_t *frame, uint32_t len) {
    set_origin_req_t req;
    if (set_origin_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_origin", "decode_fail");
        return;
    }
    uint8_t m = req.mask & 0x07u;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        if (m & (1u << axis)) {
            /* Define base externa como a posição absoluta atual e zera relativo */
            int64_t pos = g_encoder_position[axis];
            if (pos > INT32_MAX) pos = INT32_MAX; else if (pos < INT32_MIN) pos = INT32_MIN;
            g_origin_base32[axis] = (int32_t)pos;
            g_encoder_origin[axis] = g_encoder_position[axis];
        }
    }
    set_origin_resp_t resp;
    resp.frameId = req.frameId;
    resp.x0 = g_origin_base32[AXIS_X];
    resp.y0 = g_origin_base32[AXIS_Y];
    resp.z0 = g_origin_base32[AXIS_Z];
    uint8_t raw[16];
    if (set_origin_resp_encoder(&resp, raw, sizeof raw) == PROTO_OK) {
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
    LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_origin", "mask=0x%02X mode=%u", (unsigned)req.mask, (unsigned)req.mode);
}

void motion_on_encoder_status(const uint8_t *frame, uint32_t len) {
    encoder_status_req_t req;
    if (encoder_status_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "enc_status", "decode_fail");
        return;
    }
    /* posição_rel = position - origin; posição_abs = origin_base + posição_rel */
    int32_t rel[3];
    int32_t abs[3];
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        int64_t r = g_encoder_position[axis] - g_encoder_origin[axis];
        if (r > INT32_MAX) r = INT32_MAX; else if (r < INT32_MIN) r = INT32_MIN;
        rel[axis] = (int32_t)r;
        int64_t a = (int64_t)g_origin_base32[axis] + (int64_t)rel[axis];
        if (a > INT32_MAX) a = INT32_MAX; else if (a < INT32_MIN) a = INT32_MIN;
        abs[axis] = (int32_t)a;
    }
    encoder_status_resp_t resp;
    resp.frameId = req.frameId;
    resp.pidErrX = (uint8_t)g_status.pidErrX;
    resp.pidErrY = (uint8_t)g_status.pidErrY;
    resp.pidErrZ = (uint8_t)g_status.pidErrZ;
    resp.delta = 0; /* opcional */
    resp.absX = abs[AXIS_X];
    resp.absY = abs[AXIS_Y];
    resp.absZ = abs[AXIS_Z];
    uint8_t raw[20];
    if (encoder_status_resp_encoder(&resp, raw, sizeof raw) == PROTO_OK) {
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

void motion_on_set_microsteps(const uint8_t *frame, uint32_t len) {
    set_microsteps_req_t req;
    if (set_microsteps_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_microsteps", "decode_fail");
        return;
    }
    if (g_status.state == MOTION_RUNNING) {
        /* Em execução: não aplica, mas responde ACK para o host não travar */
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "set_microsteps", "busy_running");
    } else {
        uint16_t ms = (req.microsteps == 0u) ? 1u : req.microsteps;
        if (ms > 256u) ms = 256u;
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_microstep_factor[a] = ms;
        LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_microsteps", "all_axes_ms=%u", (unsigned)ms);
    }
    /* Resposta mínima (ACK): [HDR,TYPE,frameId,TAIL] */
    {
        uint8_t raw[4];
        resp_init(raw, RESP_SET_MICROSTEPS);
        raw[2] = req.frameId;
        resp_set_tail(raw, 3);
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

void motion_on_set_microsteps_axes(const uint8_t *frame, uint32_t len) {
    set_microsteps_axes_req_t req;
    if (set_microsteps_axes_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_microsteps_ax", "decode_fail");
        return;
    }
    if (g_status.state == MOTION_RUNNING) {
        /* Em execução: não aplica, mas responde ACK para o host não travar */
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "set_microsteps_ax", "busy_running");
    } else {
        uint16_t msx = (req.ms_x == 0u) ? 1u : req.ms_x; if (msx > 256u) msx = 256u;
        uint16_t msy = (req.ms_y == 0u) ? 1u : req.ms_y; if (msy > 256u) msy = 256u;
        uint16_t msz = (req.ms_z == 0u) ? 1u : req.ms_z; if (msz > 256u) msz = 256u;
        g_microstep_factor[AXIS_X] = msx;
        g_microstep_factor[AXIS_Y] = msy;
        g_microstep_factor[AXIS_Z] = msz;
        LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_microsteps_ax", "ms=(%u,%u,%u)", (unsigned)msx, (unsigned)msy, (unsigned)msz);
    }
    /* Resposta mínima (ACK) reutiliza RESP_SET_MICROSTEPS */
    {
        uint8_t raw[4];
        resp_init(raw, RESP_SET_MICROSTEPS);
        raw[2] = req.frameId;
        resp_set_tail(raw, 3);
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

/* =====================================================================
 *  DEMO DE MOVIMENTO (PARA TESTE EM BANCADA)
 *  - DDA por TIM6 (50 kHz) com rampa no TIM7 (~1 kHz)
 *  - Timings de STEP/DIR/ENABLE conforme TMC5160
 * ===================================================================== */
void motion_demo_set_enabled(uint8_t enable)
{
    if (!enable) return;

